benchmarks/bench4.txt

=====================================
Starting Benchmark: FlowJS
=====================================

Installing dependencies...
Building project...
✅ Build Time: 1.60s
📦 Output Size: 0.21 MB (dist/)
Booting Production Server...
(node:9404) [DEP0190] DeprecationWarning: Passing args to a child process with shell option true can lead to security vulnerabilities, as the arguments are not escaped, only concatenated.
(Use `node --trace-deprecation ...` to show where the warning was created)
🔥 Cold Start Latency: 29ms

Running Autocannon (10s | 100 connections)...
Running 10s test @ http://localhost:3000
100 connections

(node:10944) TimeoutNegativeWarning: -1 is a negative number.
Timeout duration was set to 1.
(Use `node --trace-warnings ...` to show where the warning was created)

┌─────────┬──────┬──────┬───────┬──────┬──────┬───────┬──────┐
│ Stat    │ 2.5% │ 50%  │ 97.5% │ 99%  │ Avg  │ Stdev │ Max  │
├─────────┼──────┼──────┼───────┼──────┼──────┼───────┼──────┤
│ Latency │ 0 ms │ 0 ms │ 0 ms  │ 0 ms │ 0 ms │ 0 ms  │ 0 ms │
└─────────┴──────┴──────┴───────┴──────┴──────┴───────┴──────┘
┌───────────┬─────┬──────┬─────┬───────┬─────┬───────┬─────┐
│ Stat      │ 1%  │ 2.5% │ 50% │ 97.5% │ Avg │ Stdev │ Min │
├───────────┼─────┼──────┼─────┼───────┼─────┼───────┼─────┤
│ Req/Sec   │ 0   │ 0    │ 0   │ 0     │ 0   │ 0     │ 0   │
├───────────┼─────┼──────┼─────┼───────┼─────┼───────┼─────┤
│ Bytes/Sec │ 0 B │ 0 B  │ 0 B │ 0 B   │ 0 B │ 0 B   │ 0 B │
└───────────┴─────┴──────┴─────┴───────┴─────┴───────┴─────┘
┌──────┬───────┐
│ Code │ Count │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 10

297 requests in 10.08s, 0 B read
197 errors (100 timeouts)
🚀 Req/Sec: N/A
⏱️  p50 Latency: N/A
⏱️  p95 Latency: N/A

=====================================
Starting Benchmark: Next.js
=====================================

Installing dependencies...
Building project...
✅ Build Time: 5.93s
📦 Output Size: 5.33 MB (.next/)
Booting Production Server...
🔥 Cold Start Latency: 1008ms

Running Autocannon (10s | 100 connections)...
Running 10s test @ http://localhost:3000
100 connections


┌─────────┬────────┬────────┬────────┬────────┬───────────┬──────────┬────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%  │ 99%    │ Avg       │ Stdev    │ Max    │
├─────────┼────────┼────────┼────────┼────────┼───────────┼──────────┼────────┤
│ Latency │ 150 ms │ 158 ms │ 233 ms │ 338 ms │ 167.07 ms │ 27.88 ms │ 348 ms │
└─────────┴────────┴────────┴────────┴────────┴───────────┴──────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼────────┼─────────┤
│ Req/Sec   │ 400     │ 400     │ 600     │ 700     │ 597,6   │ 86,91  │ 400     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼────────┼─────────┤
│ Bytes/Sec │ 2.55 MB │ 2.55 MB │ 3.83 MB │ 4.46 MB │ 3.81 MB │ 554 kB │ 2.55 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 5976  │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 10

6k requests in 10.07s, 38.1 MB read
🚀 Req/Sec: N/A
⏱️  p50 Latency: N/A
⏱️  p95 Latency: N/A

=====================================
Starting Benchmark: Vite SSR
=====================================

Installing dependencies...
Building project...
✅ Build Time: 1.56s
📦 Output Size: 0.14 MB (dist/)
Booting Production Server...
❌ Benchmark failed for Vite SSR:
Timed out waiting for: tcp:3000


=============================================
              FINAL RESULTS                   
=============================================

┌─────────┬────────────┬─────────────┬────────────┬─────────┬─────────────┬─────────────┐
│ (index) │ Build Time │ Output Size │ Cold Start │ Req/Sec │ p50 Latency │ p95 Latency │
├─────────┼────────────┼─────────────┼────────────┼─────────┼─────────────┼─────────────┤
│ FlowJS  │ '1.60s'    │ '0.21 MB'   │ '29ms'     │ 'N/A'   │ 'N/A'       │ 'N/A'       │
│ Next.js │ '5.93s'    │ '5.33 MB'   │ '1008ms'   │ 'N/A'   │ 'N/A'       │ 'N/A'       │
└─────────┴────────────┴─────────────┴────────────┴─────────┴─────────────┴─────────────┘

Copy the table above into your markdown report!